# -*- coding: utf-8 -*-
# -*- mode: org -*-

#+TITLE: Duelling Signals: Differentiable DSP in Faust
#+AUTHOR: Thomas Rushton

#+OPTIONS: num:nil toc:nil reveal_width:1200

#+REVEAL_ROOT: ./reveal.js
# #+REVEAL_THEME: white
#+REVEAL_PLUGINS: (math)
#+REVEAL_EXTRA_CSS: phd-day-2024.css
#+REVEAL_MIN_SCALE: 1.0
#+REVEAL_MAX_SCALE: 1.0
# #+REVEAL_HIGHLIGHT_CSS: %r/plugin/highlight/monokai.css
# #+REVEAL_HIGHLIGHT_CSS: %r/node_modules/highlight.js/styles/zenburn.css
# #+REVEAL_EXTRA_SCRIPTS: <script src="https://cdn.jsdelivr.net/npm/@grame/faust-web-component@0.3.2/dist/faust-web-component.js" defer></script>
#+REVEAL_EXTRA_SCRIPTS: ("faust-web-component.js" "faust-stop-on-slidechanged.js")
#+REVEAL_TITLE_SLIDE: <h1>%t</h1><h2>%s</h2><h3>%a</h3>

** A basic Faust program

- Two input signals — implicit
- One output signal: the sum of the inputs

#+begin_src faust :results html :exports both :tab svg :sizes 0,100 :class add
process = +;
#+end_src

#+RESULTS:
#+begin_export html
<faust-editor sizes="[0,100]" tab="svg">
<!--
process = +;
-->
</faust-editor>
#+end_export

** A basic Faust synthesiser

#+begin_src faust :results html :exports both :tab ui :sizes 0,100 :class synth
import("stdfaust.lib");
process = sum(i, 10, os.osc(220*((i+1)^1.8)) : *(1/(i+1))) 
    : *(en.ar(.025, 2.5, button("gate")))
    : *(.5)
    <: _,_;
#+end_src

#+RESULTS:
#+begin_export html
<faust-editor sizes="[0,100]" tab="ui">
<!--
import("stdfaust.lib");
process = sum(i, 10, os.osc(220*((i+1)^1.8)) : *(1/(i+1))) 
    : *(en.ar(.025, 2.5, button("gate")))
    : *(.5)
    <: _,_;
-->
</faust-editor>
#+end_export

** A recursive Faust program

- One input
- One output: the sum of the input and scaled, delayed copy of the output

#+begin_src faust :results html :exports both :tab svg :sizes 0,100 :class echo
process = +~(@(10000) : *(.5));
#+end_src

#+RESULTS:
#+begin_export html
<faust-editor sizes="[0,100]" tab="svg">
<!--
process = +~(@(10000) : *(.5));
-->
</faust-editor>
#+end_export

** A Differentiable Primitive

#+begin_src faust :results silent
process = +;
#+end_src

#+ATTR_REVEAL: :frag t
$y = u + v$

#+ATTR_REVEAL: :frag t
Differentiate wrt. $x$:
\[
\frac{dy}{dx} = \frac{d}{dx}\left(u + v\right) = \frac{du}{dx} +
\frac{dv}{dx}
\]

#+REVEAL: split

- We can represent the addition and its derivative in parallel

#+begin_src faust :results html :exports both :tab svg :sizes 0,100 :class dual-add
process = +,+;
#+end_src

#+RESULTS:
#+begin_export html
<faust-editor sizes="[0,100]" tab="svg" class="dual-add">
<!--
process = +,+;
-->
</faust-editor>
#+end_export

#+ATTR_REVEAL: :frag t
\begin{align*}
\langle y, \frac{dy}{dx} \rangle
&= \langle u, \frac{du}{dx} \rangle + \langle v, \frac{dv}{dx} \rangle \\
&= \langle u + v, \frac{du}{dx} + \frac{dv}{dx} \rangle
\end{align*}

Dual number \rightarrow */Dual signal/*

** /Where's the derivative?/

#+REVEAL: split
It's assumed that each derivative has been calculated elsewhere

#+begin_src faust :results html :exports both :tab svg :sizes 0,100 :class dual-add-again
x = hslider("x", 0, -1, 1, .1);
u = _;
v = x;
dudx = 0;
dvdx = 1;
process = u,v,dudx,dvdx : +,+;
#+end_src

#+RESULTS:
#+begin_export html
<faust-editor sizes="[0,100]" tab="svg" class="dual-add-again">
<!--
x = hslider("x", 0, -1, 1, .1);
u = _;
v = x;
dudx = 0;
dvdx = 1;
process = u,v,dudx,dvdx : +,+;
-->
</faust-editor>
#+end_export

** Making it /Automatic/

#+begin_src faust :results silent
diffInput = _,0;
diffSlider = hslider("x", 0, -1, 1, .1),1;
#+end_src

#+ATTR_REVEAL: :frag t
#+begin_src faust :results silent
diffAdd = route(4,4,(1,1),(2,3),(3,2),(4,4)) : +,+;
#+end_src

#+REVEAL: split

#+begin_src faust :results html :exports results :tab svg :sizes 0,100 :class dual-add-again
diffInput = _,0;
diffSlider = hslider("x", 0, -1, 1, .1),1;
diffAdd = route(4,4,(1,1),(2,3),(3,2),(4,4)) : +,+;
process = diffInput,diffSlider : diffAdd;
#+end_src

#+RESULTS:
#+begin_export html
<faust-editor sizes="[0,100]" tab="svg" class="dual-add-again">
<!--
diffInput = _,0;
diffSlider = hslider("x", 0, -1, 1, .1),1;
diffAdd = route(4,4,(1,1),(2,3),(3,2),(4,4)) : +,+;
process = diffInput,diffSlider : diffAdd;
-->
</faust-editor>
#+end_export

*** Variable gain and DC offset

#+begin_src faust :results html :exports both :tab svg :sizes 0,100 :class multivariate
x1 = hslider("gain", .5, 0, 1, .1);
x2 = hslider("dc", 0, -1, 1, .1);
process = _,x1 : *,x2 : +;
#+end_src

#+RESULTS:
#+begin_export html
<faust-editor sizes="[0,100]" tab="svg" class="multivariate">
<!--
x1 = hslider("gain", .5, 0, 1, .1);
x2 = hslider("dc", 0, -1, 1, .1);
process = _,x1 : *,x2 : +;
-->
</faust-editor>
#+end_export

\[y = uv + w, \quad v = x_1, \quad w = x_2\]

#+ATTR_REVEAL: :frag t
\[
y' = \frac{\partial y}{\partial \mathbf{x}}
= \begin{bmatrix}\frac{\partial y}{\partial x_1} \\
\frac{\partial y}{\partial x_2}\end{bmatrix}
\]

